In [13]:
import matplotlib
import pandas as pd

In [ ]:
olym_data = pd.read_csv(r"Data\athlete_events.csv")

In [ ]:
olym_data.columns

In [ ]:
olym_data.sample(5)

In [ ]:
len(olym_data)

In [ ]:
print('Number of unique ID:\t\t\t\t', len(olym_data['ID'].unique()))
print('Number of unique atheletes: \t\t\t',len(olym_data['Name'].unique()))
print('Number of unique Games (i.e 2006 Winter): \t',len(olym_data['Games'].unique()))
print('Number of unique Year: \t\t\t\t',len(olym_data['Year'].unique()))
print('Number of unique host city:\t\t\t',len(olym_data['City'].unique()))
print('Number of unique participate team:\t\t',len(olym_data['Team'].unique()))
print('Number of unique region:\t\t\t',len(olym_data['NOC'].unique()))
print('Number of unique Sport:\t\t\t\t',len(olym_data['Sport'].unique()))
print('Number of unique Sport event:\t\t\t',len(olym_data['Event'].unique()))

In [ ]:
olym_data['Age'].describe()

In [ ]:
print(olym_data[olym_data['ID'] == 124123])

olym_data['Year'].describe()

In [57]:
noc = pd.read_csv(r"Data\noc_regions.csv")

In [71]:
noc

     NOC       region                 notes
0    AFG  Afghanistan                   NaN
1    AHO      Curacao  Netherlands Antilles
2    ALB      Albania                   NaN
3    ALG      Algeria                   NaN
4    AND      Andorra                   NaN
..   ...          ...                   ...
225  YEM        Yemen                   NaN
226  YMD        Yemen           South Yemen
227  YUG       Serbia            Yugoslavia
228  ZAM       Zambia                   NaN
229  ZIM     Zimbabwe                   NaN

[230 rows x 3 columns]

In [59]:
import tabula
df_all = tabula.read_pdf(r"Data\List-of-National-Olympic-Committees-in-IOC-Protocol-Order.pdf", pages='all', stream = True)

In [60]:
for d in df_all:
    d.set_index('Numbering')

In [61]:
df = df_all[0]
for d in df_all:
    df = pd.concat([df, d])

In [62]:
len(df)

256

In [63]:
df_test = df.drop_duplicates()
len(df_test)

210

In [64]:
df_test

,Numbering,Continental,NOC,English,French
0,Order,Association,NaN,NaN,NaN
1,1,Asia,AFG,Afghanistan,Afghanistan
2,2,Africa,RSA,South Africa,Afrique du Sud
3,3,Europe,ALB,Albania,Albanie
4,4,Africa,ALG,Algeria,Algérie
...,...,...,...,...,...
32,205,Africa,ZAM,Zambia,Zambie
33,206,Africa,ZIM,Zimbabwe,Zimbabwe
34,207,N/A,IOA,Independent Olympic Athletes,Athlètes olympiques indépendants
35,208,N/A,IOP,Independent Olympic Participants,Participants olympiques indépendants
36,209,N/A,EOR,IOC Refugee Olympic Team,Équipe olympique de réfugiés

In [65]:
df_out = df_test[['Numbering','Continental','NOC']]

In [66]:
df_out

   Numbering  Continental  NOC
0      Order  Association  NaN
1          1         Asia  AFG
2          2       Africa  RSA
3          3       Europe  ALB
4          4       Africa  ALG
..       ...          ...  ...
32       205       Africa  ZAM
33       206       Africa  ZIM
34       207          N/A  IOA
35       208          N/A  IOP
36       209          N/A  EOR

[210 rows x 3 columns]

In [72]:
new_noc = noc.merge(df_out, how='left', left_on= 'NOC', right_on = 'NOC')

In [76]:
new_noc.drop('Numbering', axis = 1)

     NOC       region                 notes Continental
0    AFG  Afghanistan                   NaN        Asia
1    AHO      Curacao  Netherlands Antilles         NaN
2    ALB      Albania                   NaN      Europe
3    ALG      Algeria                   NaN      Africa
4    AND      Andorra                   NaN      Europe
..   ...          ...                   ...         ...
225  YEM        Yemen                   NaN        Asia
226  YMD        Yemen           South Yemen         NaN
227  YUG       Serbia            Yugoslavia         NaN
228  ZAM       Zambia                   NaN      Africa
229  ZIM     Zimbabwe                   NaN      Africa

[230 rows x 4 columns]

In [95]:
print(len(new_noc[new_noc.duplicated(['region'])]))

23

In [96]:
print(len(noc[noc.duplicated(['region'])]))

23

In [98]:
new_noc.to_csv('Data/noc_continents.csv')